rpc_examples/016_IPPing_diagnostic.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">100</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <cwmp:SetParameterValues>
      <ParameterList arrayType="cwmp:ParameterValueStruct[6]">
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.DSCP</Name>
          <Value xsi:type="xsd:unsignedInt">0</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.Host</Name>
          <Value xsi:type="xsd:string">www.qq.com</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.NumberOfRepetitions</Name>
          <Value xsi:type="xsd:unsignedInt">5</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.DataBlockSize</Name>
          <Value xsi:type="xsd:unsignedInt">256</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.Timeout</Name>
          <Value xsi:type="xsd:unsignedInt">5000</Value>
        </ParameterValueStruct>
        <ParameterValueStruct>
          <Name>Device.IP.Diagnostics.IPPing.DiagnosticsState</Name>
          <Value xsi:type="xsd:string">Requested</Value>
        </ParameterValueStruct>
      </ParameterList>
      <ParameterKey>twoweekdebug</ParameterKey>
    </cwmp:SetParameterValues>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

